# Run SQL Inside A Notebook

Here's an interesting alternative to sequel ace.

Install the package with

```
pip install ipython-sql
```

In [1]:
# load extension and initial connection -- do this once per notebook
%load_ext sql

import env
%sql mysql+pymysql://$env.user:$env.password@$env.host/numbers

For a one-line query:

In [2]:
%sql SELECT * FROM numbers2

 * mysql+pymysql://zach:***@157.230.209.171/numbers
10 rows affected.

[(10, 'a', 'one'),
 (2, 'b', 'two'),
 (3, 'c', 'one'),
 (4, 'a', 'two'),
 (5, 'b', 'one'),
 (6, 'c', 'two'),
 (7, 'a', 'one'),
 (8, 'b', 'two'),
 (9, 'c', 'one'),
 (10, 'a', 'two')]

For a multiline query:

In [3]:
%%sql

SELECT
    category,
    supergroup,
    count(*) AS n
FROM numbers2
GROUP BY category, supergroup WITH ROLLUP

 * mysql+pymysql://zach:***@157.230.209.171/numbers
10 rows affected.

[('a', 'one', 2),
 ('a', 'two', 2),
 ('a', None, 4),
 ('b', 'one', 1),
 ('b', 'two', 2),
 ('b', None, 3),
 ('c', 'one', 2),
 ('c', 'two', 1),
 ('c', None, 3),
 (None, None, 10)]

You can even mix and match this with python code:

In [4]:
# grab the result of the last sql query
result = _
df = result.DataFrame()

In [5]:
df

  category supergroup   n
0        a        one   2
1        a        two   2
2        a       None   4
3        b        one   1
4        b        two   2
5        b       None   3
6        c        one   2
7        c        two   1
8        c       None   3
9     None       None  10